In [ ]:
import pandas as pd
srs = pd.Series(['red','green','blue','white','black'])
srs

0      red
1    green
2     blue
3    white
4    black
dtype: object

Here 0,1,2,3,4 are the index values

Example for accessing values in a series using Index

In [ ]:
srs[0]

'red'

In [ ]:
srs[3]

'white'

Unlike Series DataFrame is 2-Dimensional

In [ ]:
srs_a = pd.Series([10,20,30,40,50])
srs_b = pd.Series(['red','green','blue','white','black'])
df = pd.DataFrame({'a' : srs_a, 'b' : srs_b})
df

    a      b
0  10    red
1  20  green
2  30   blue
3  40  white
4  50  black

To access an element within DataFrame we need to provide two indexes (one for row and another for column)

In [ ]:
df.loc[2,'b']

'blue'

In [ ]:
df.loc[3,'a']

40

In [ ]:
import numpy as np
srs = pd.Series([1,3,np.nan,4,np.nan])

In [ ]:
srs.dropna()

0    1.0
1    3.0
3    4.0
dtype: float64

As Series axis=0 dropna() will work same for dropna() and dropna(axis=0)

In [ ]:
srs.dropna(axis=0)

0    1.0
1    3.0
3    4.0
dtype: float64

Here dtype refers to datatype In this case its float64

we can change the datatype by using astype()

In [ ]:
df['a'].astype(int)

0    10
1    20
2    30
3    40
4    50
Name: a, dtype: int32

Now as we see the dtype is changed to int32 (32 refers to the memory allocated to hold that character)

In [ ]:
df.sum(axis=0)

a                       150
b    redgreenbluewhiteblack
dtype: object

axis=0 determines along which direction the operation is performed

axis=1 produces a sum for each row

In [ ]:
df.sum(axis=1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

If numbers seems confusing we can use labels like 'index' and 'rows' for axis=0 and 'columns' for axis=1

In [ ]:
df.sum(axis='index')

a                       150
b    redgreenbluewhiteblack
dtype: object

In [ ]:
df.sum(axis='rows')

a                       150
b    redgreenbluewhiteblack
dtype: object

In [ ]:
df.sum(axis='columns')

0    10
1    20
2    30
3    40
4    50
dtype: int64

Dropping NaN values

In [ ]:
df = pd.DataFrame({'a':[2,np.nan,8,3],'b':[np.nan, 32, 15, 7], 'c': [-3, 5, 22, 19]})
df

     a     b   c
0  2.0   NaN  -3
1  NaN  32.0   5
2  8.0  15.0  22
3  3.0   7.0  19

In [ ]:
df.dropna(axis=0)

     a     b   c
2  8.0  15.0  22
3  3.0   7.0  19

In [ ]:
df.dropna(axis=1)

    c
0  -3
1   5
2  22
3  19

Concatenation

In [ ]:
df1 = pd.DataFrame({'a':[1,3,6,8,9], 'b': ['red','green','blue','white','black']})

In [ ]:
df2 = pd.DataFrame({'a':[0,2,4,5,7], 'b': ['jun','jul','aug','sep','oct']})

In [ ]:
pd.concat([df1,df2],axis=0)

   a      b
0  1    red
1  3  green
2  6   blue
3  8  white
4  9  black
0  0    jun
1  2    jul
2  4    aug
3  5    sep
4  7    oct

In [ ]:
pd.concat([df1,df2],axis=1)

   a      b  a    b
0  1    red  0  jun
1  3  green  2  jul
2  6   blue  4  aug
3  8  white  5  sep
4  9  black  7  oct